# AnalysisDisplayColorSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayColorSettings Properties
AnalysisDisplayColorSettings Class See Also
---
The AnalysisDisplayColorSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ColorSettingsType | Stores type of color settings |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MaxColor | Color assigned to the maximum value. |
| MinColor | Color assigned to the minimum value. |

# See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace